Revit 2027 API
SpatialFieldManager.Clear Method
 Clear all analysis results managed by this manager object
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Clear()
Public Sub Clear
public:
void Clear()
member Clear : unit -> unit
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace